; використовується процесор з ядром і586 і вище
.586

.model flat 

;flat - вказує на те, що всі сегменти розміщені фізично в одному сегменті

; Узгодження, які використовує лінкер для мови С передбачають:
; 1. аргументи функціям передаються через стек;
; 2. викликаюча функція очищає стек від параметрів;
; 3. аргументи завантажуються в стек перед викликом функції справа на ліво;
; 4. імена ідентифікаторів мають префікс "підкреслення" (_);
; 5. імена ідентифікаторів є регістрозалежними (є різниця між великими і малими буквами);
; 6. функції повертають значення в регістропару eax:edx.


PUBLIC _calc

.data
	K EQU 4569600Fh
	Temp1	dd	00h
	Temp2	dd	00h
	
.code
	
	; Процедура _calc має 2 параметри і використовує узгодження мови С
	_calc PROC ; ближня процедура
	
	; в стеку на даний момент є 32-ох розрядна ближня адреса пвернення з процедури
	; збережемо в стек 32-ох розрядне значення ebp	
		push ebp
		mov ebp,esp
		xor eax,eax
		xor ebx,ebx
		xor ecx,ecx
		xor edx,edx
		mov eax,[ebp+16]
		mov ebx,2
		idiv bx
		mov Temp1,eax
		mov eax,[ebp+8]
		mov bx,4
		imul bx
		mov Temp2,eax
		mov eax,[ebp+12]
		add eax,Temp2
		sub eax,Temp1
		add eax,K
		pop ebp
ret
		
	_calc endp
end
		

